
&НаСервере
Процедура СоздатьТочкуИОчередьВRabbitMQНаСервере() 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", Объект.ЭкземплярRMQ.ИмяСервера);
	СтруктураПараметров.Вставить("Порт", Объект.ЭкземплярRMQ.Порт);
	СтруктураПараметров.Вставить("Логин", Объект.ЭкземплярRMQ.Имя);
	СтруктураПараметров.Вставить("Пароль", Объект.ЭкземплярRMQ.Пароль);
	СтруктураПараметров.Вставить("ВиртуальныйХост", Объект.ЭкземплярRMQ.ВиртуальныйХост);	
	СтруктураПараметров.Вставить("ТочкаОбмена", Объект.ТочкаОбмена.Наименование);
	СтруктураПараметров.Вставить("Канал", Объект.ТочкаОбмена.Канал);
	СтруктураПараметров.Вставить("ИмяОчереди", Объект.Очередь);
	СтруктураПараметров.Вставить("КлючМаршрутизации", Объект.КлючМаршрутизации);
	
	Обработки.ОбменRMQ.СоздатьТочкуИОчередьВRabbitMQ(СтруктураПараметров);  
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТочкуИОчередьВRabbitMQ(Команда) 
	
	СоздатьТочкуИОчередьВRabbitMQНаСервере();   
		
КонецПроцедуры
