
&НаСервере
Процедура Расш1_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЭтаФорма["НачалоВремени"] = ОценкаПроизводительности.НачатьЗамерВремени();
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
Процедура Расш1_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительности.ЗакончитьЗамерВремени("ПроведениеДокументаРеализацияСертификатовПередЗаписьюСервер", ЭтаФорма["НачалоВремени"]);
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.ИмяФормы = "Документ.РеализацияСертификатов.Форма.ФормаДокумента" Тогда
		ДобавляемыеРеквизиты	= Новый Массив;				
		Реквизит_НачалоВремени = Новый РеквизитФормы("НачалоВремени", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(50)));
		ДобавляемыеРеквизиты.Добавить(Реквизит_НачалоВремени);  		
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры
