//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ 
//
// Модуль содержит процедуры и функции, предназначенные для работы с торговым оборудованием

// Начинает подключение к сканеру штрихкодов
//
// Параметры: 
//  ОписаниеЗавершение - описание оповещения, которое будет вызвано при завершении операции
//
// Возвращаемое значение:
//  Нет
Процедура НачатьПодключениеСканераШтрихкодов() Экспорт
	ВыполнитьПодключениеДрайвераСканераШтрихкодов();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьПодключениеДрайвераСканераШтрихкодов()
КонецПроцедуры

// Отключение от сканера штрихкодов
// Параметры: 
Процедура НачатьОтключениеСканераШтрихкодов(ОповещениеЗавершение) Экспорт
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьОтключениеСканераШтрихкодов()
	
КонецПроцедуры

// Возвращает тип операционной системы
// 
// Параметры: 
//  Нет
// 
// Возвращаемое значение: 
//  Строка 'Windows' или 'Linux'
Функция ПолучитьТипОС()
	
	ИнформацияОСистеме = Новый СистемнаяИнформация;
	
	Если ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		
		ТипОС = "Windows";
		
	ИначеЕсли ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		
		ТипОС = "Linux";
		
	КонецЕсли;
	
	Возврат ТипОС;
	
КонецФункции
