///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
//{{MRG[ <-> ]
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//#Если НЕ МобильныйАвтономныйСервер Тогда
//	Если ИменаПараметровСеанса = Неопределено Тогда
//		Пользователи.ОпределитьТекущегоПользователя();
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		
//		ПараметрыСеанса.ЯщикIMAP = "";
//	КонецЕсли;
//#КонецЕсли
//}}MRG[ <-> ]
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли