
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   
	Если ОбменДанными.Загрузка Тогда
		
		возврат;
		
	КонецЕсли;
	
	Если Проведен Тогда
		
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
		
	КонецЕсли;	
	
	Если Константы.ЦентральныйМагазин.Получить() = Константы.ТекущийМагазин.Получить() Тогда 
		возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ПроверитьСертификатыСписания(Отказ);

	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	

	Для Каждого ТекСтрокаСертификаты Из Сертификаты Цикл
		НоваяЗапись = РегистрыСведений.СтатусыСертификатов.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ПодарочныйСертификат = ТекСтрокаСертификаты.Сертификат;
		НоваяЗапись.Статус = Перечисления.СтатусыПодарочныхСертификатов.Списан; 
		НоваяЗапись.Записать(Истина);
	КонецЦикла;
 
	Движения.ПодарочныеСертификаты.Записывать = Истина;
	Для Каждого ТекСтрокаСертификаты Из Сертификаты Цикл
		Движение = Движения.ПодарочныеСертификаты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ПодарочныйСертификат = ТекСтрокаСертификаты.Сертификат;
		Движение.Сумма = ТекСтрокаСертификаты.Сертификат.Сумма;
	КонецЦикла;

КонецПроцедуры  

Функция ПроверитьСертификатыСписания(Отказ) 
		
	СертификатыДокумента = Сертификаты.ВыгрузитьКолонку("Сертификат");
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодарочныеСертификаты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Сертификаты
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|ГДЕ
		|	ПодарочныеСертификаты.Ссылка В(&СертификатыДокумента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	данные.Статус КАК Статус,
		|	данные.ПодарочныйСертификатПредставление КАК ПодарочныйСертификатПредставление
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(СтатусыСертификатовСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПустаяССылка)) КАК Статус,
		|		Сертификаты.Ссылка.Представление КАК ПодарочныйСертификатПредставление
		|	ИЗ
		|		Сертификаты КАК Сертификаты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСертификатов.СрезПоследних(&Дата, ПодарочныйСертификат В (&СертификатыДокумента)) КАК СтатусыСертификатовСрезПоследних
		|			ПО Сертификаты.Ссылка = СтатусыСертификатовСрезПоследних.ПодарочныйСертификат
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСТЬNULL(СтатусыСертификатовСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПустаяССылка)),
		|		Сертификаты.Ссылка.Представление) КАК данные
		|ГДЕ
		|	данные.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Реализован)";
	
	Запрос.УстановитьПараметр("СертификатыДокумента", СертификатыДокумента);
    Запрос.УстановитьПараметр("Дата", КонецДня(ЭтотОбъект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ТекстСообщения = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + ВыборкаДетальныеЗаписи.ПодарочныйСертификатПредставление + "(Статус "+?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Статус), ВыборкаДетальныеЗаписи.Статус, "не установлен")+")" + Символы.ПС;
	КонецЦикла;
	
	Если ТекстСообщения <> "" Тогда
		Отказ = Истина; 		
		ТекстСообщения = "В документе найдены неподходящие для списания сертификаты, проведение невозможно 
		|" + ТекстСообщения + ".";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецФункции



Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроверитьДоступностьВыбранныхСертификатовОтмена(Отказ);
	
	Если не Отказ Тогда
		
		
	СертификатыДокумента = Сертификаты.ВыгрузитьКолонку("Сертификат");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодарочныеСертификаты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Сертификаты
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|ГДЕ
		|	ПодарочныеСертификаты.Ссылка В(&СертификатыДокумента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СтатусыСертификатовСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПустаяССылка)) КАК Статус,
		|	Сертификаты.Ссылка.Представление КАК ПодарочныйСертификатПредставление,
		|	СтатусыСертификатовСрезПоследних.Период КАК Период,
		|	СтатусыСертификатовСрезПоследних.ПодарочныйСертификат КАК ПодарочныйСертификат
		|ИЗ
		|	Сертификаты КАК Сертификаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСертификатов.СрезПоследних(&Дата, ПодарочныйСертификат В (&СертификатыДокумента)) КАК СтатусыСертификатовСрезПоследних
		|		ПО Сертификаты.Ссылка = СтатусыСертификатовСрезПоследних.ПодарочныйСертификат
		|ГДЕ
		|	ЕСТЬNULL(СтатусыСертификатовСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПустаяССылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Списан)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сертификаты.Ссылка.Представление,
		|	ЕСТЬNULL(СтатусыСертификатовСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПустаяССылка)),
		|	СтатусыСертификатовСрезПоследних.Период,
		|	СтатусыСертификатовСрезПоследних.ПодарочныйСертификат";

		
	
	Запрос.УстановитьПараметр("СертификатыДокумента", СертификатыДокумента);
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		НоваяЗапись = РегистрыСведений.СтатусыСертификатов.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ВыборкаДетальныеЗаписи.Период;
		НоваяЗапись.ПодарочныйСертификат = ВыборкаДетальныеЗаписи.Сертификат;
		НоваяЗапись.Статус = Перечисления.СтатусыПодарочныхСертификатов.Списан; 
		НоваяЗапись.Записать(Истина);
 		НоваяЗапись.Прочитать();
         НоваяЗапись.Удалить();			
	КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

Процедура ПроверитьДоступностьВыбранныхСертификатовОтмена(Отказ) 
	
	СертификатыДокумента = Сертификаты.ВыгрузитьКолонку("Сертификат");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодарочныеСертификаты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Сертификаты
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|ГДЕ
		|	ПодарочныеСертификаты.Ссылка В(&СертификатыДокумента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СтатусыСертификатовСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПустаяССылка)) КАК Статус,
		|	Сертификаты.Ссылка.Представление КАК ПодарочныйСертификатПредставление
		|ИЗ
		|	Сертификаты КАК Сертификаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСертификатов.СрезПоследних(&Дата, ПодарочныйСертификат В (&СертификатыДокумента)) КАК СтатусыСертификатовСрезПоследних
		|		ПО Сертификаты.Ссылка = СтатусыСертификатовСрезПоследних.ПодарочныйСертификат
		|ГДЕ
		|	ЕСТЬNULL(СтатусыСертификатовСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПустаяССылка)) <> ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Списан)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сертификаты.Ссылка.Представление,
		|	ЕСТЬNULL(СтатусыСертификатовСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПустаяССылка))";

		
	
	Запрос.УстановитьПараметр("СертификатыДокумента", СертификатыДокумента);
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ТекстСообщения = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + ВыборкаДетальныеЗаписи.ПодарочныйСертификатПредставление + "(Статус "+?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Статус), ВыборкаДетальныеЗаписи.Статус, "не установлен")+")" + Символы.ПС;
	КонецЦикла;
	
	Если ТекстСообщения <> "" Тогда
		Отказ = Истина; 		
		ТекстСообщения = "В документе найдены неподходящие для реализации сертификаты, проведение невозможно 
		|" + ТекстСообщения + ".";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецЕсли;
		
КонецПроцедуры

