
&НаСервере
Процедура СгенерироватьСертификатыНаСервере()
	Для каждого СтрокаГенерации Из Объект.ПараметрыГенерации Цикл
	
		Для сч=1 По СтрокаГенерации.КоличествоСертификатов Цикл
		
			Сертификат = Справочники.ПодарочныеСертификаты.СоздатьЭлемент();
			Сертификат.Сумма = СтрокаГенерации.СуммаСертификата;
			Сертификат.Магазин = Константы.ТекущийМагазин.Получить();
			Сертификат.УстановитьНовыйКод();
			Сертификат.Записать();
		
		КонецЦикла;
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСертификаты(Команда)
	СгенерироватьСертификатыНаСервере();
КонецПроцедуры
